Revit 2027 API
SpatialElementType Enumeration
 An enumerated type listing types of spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SpatialElementType
Public Enumeration SpatialElementType
public enum class SpatialElementType
type SpatialElementType
Members
Member name | Value | Description
Area | 2 |  Area
ElectricalLoadArea | 4 |  Electrical Load Area
Room | 1 |  Room
Space | 3 |  Space
See Also
Reference
Autodesk.Revit.DB Namespace